#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fabric_policies.aci_fabric_if_pol.if_policy: Refreshing state... [id=uni/infra/hintfpol-link_level_auto]
module.devvie_project_2.aci_epg_to_contract.provided_contract: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_2_ap/epg-devvie_project_2_epg/rsprov-Established]
module.devvie_project_2.aci_application_epg.devvie_application_epg: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_2_ap/epg-devvie_project_2_epg]
module.devvie_project_2.aci_subnet.subnet: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_2_ap/epg-devvie_project_2_epg/subnet-[192.168.16.1/24]]
module.devvie_project_2.aci_application_profile.devvie_app_profile: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_2_ap]
module.devvie_project_2.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-aaep_devvie/gen-default/rsfuncToEpg-[uni/tn-devvie/ap-devvie_project_2_ap/epg-devvie_project_2_epg]]
module.devvie_project_2.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_2_ap/epg-devvie_project_2_epg/rsdomAtt-[uni/phys-physdom_devvie]]
module.devvie_project_2.aci_bridge_domain.devvie_bridge_domain: Refreshing state... [id=uni/tn-devvie/BD-vlan_16_bd]
module.tenant_policies.aci_tenant.devvie: Refreshing state... [id=uni/tn-devvie]
module.fabric_policies.aci_miscabling_protocol_interface_policy.mcp_policy: Refreshing state... [id=uni/infra/mcpIfP-mcp_policy]
module.devvie_project_2.netbox_vlan.vlan: Refreshing state... [id=6]
module.tenant_policies.data.aci_tenant.common: Reading...
module.devvie_project_2.netbox_prefix.prefix: Refreshing state... [id=5]
module.fabric_policies.aci_vlan_pool.devvie_vlan_pool: Refreshing state... [id=uni/infra/vlanns-[devvie_vlan_pool]-static]
module.fabric_policies.aci_lacp_policy.lacp_policy: Refreshing state... [id=uni/infra/lacplagp-lacp_policy_active]
module.devvie_project_1.data.aci_tenant.common: Reading...
module.fabric_policies.aci_lldp_interface_policy.lldp_policy: Refreshing state... [id=uni/infra/lldpIfP-lldp_policy]
module.fabric_policies.aci_cdp_interface_policy.cdp_policy: Refreshing state... [id=uni/infra/cdpIfP-cdp_policy]
module.devvie_project_1.netbox_vlan.vlan: Refreshing state... [id=4]
module.tenant_policies.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]
module.tenant_policies.aci_vrf.devvie: Refreshing state... [id=uni/tn-devvie/ctx-devvie]
module.tenant_policies.aci_vrf.common: Refreshing state... [id=uni/tn-common/ctx-common]
module.devvie_project_1.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]
module.tenant_policies.aci_filter.est: Refreshing state... [id=uni/tn-common/flt-est]
module.tenant_policies.aci_contract.est: Refreshing state... [id=uni/tn-common/brc-Established]
module.devvie_project_1.aci_application_profile.devvie_app_profile: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap]
module.fabric_policies.aci_physical_domain.devvie_physdom: Refreshing state... [id=uni/phys-physdom_devvie]
module.fabric_policies.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[devvie_vlan_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.devvie_project_1.aci_bridge_domain.devvie_bridge_domain: Refreshing state... [id=uni/tn-devvie/BD-vlan_15_bd]
module.devvie_project_1.netbox_prefix.prefix: Refreshing state... [id=3]
module.tenant_policies.aci_any.vzany: Refreshing state... [id=uni/tn-devvie/ctx-devvie/any]
module.fabric_policies.aci_attachable_access_entity_profile.devvie_aaep: Refreshing state... [id=uni/infra/attentp-aaep_devvie]
module.devvie_project_1.aci_application_epg.devvie_application_epg: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg]
module.fabric_policies.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-aaep_devvie/gen-default]
module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_2"]: Refreshing state... [id=uni/infra/funcprof/accbundle-VPC_DEVVIE_2]
module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_1"]: Refreshing state... [id=uni/infra/funcprof/accbundle-VPC_DEVVIE_1]
module.devvie_project_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/rsdomAtt-[uni/phys-physdom_devvie]]
module.devvie_project_1.aci_epg_to_contract.provided_contract: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/rsprov-Established]
module.devvie_project_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/subnet-[192.168.15.1/24]]
module.devvie_project_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-aaep_devvie/gen-default/rsfuncToEpg-[uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg]]
module.tenant_policies.aci_filter_entry.est: Refreshing state... [id=uni/tn-common/flt-est/e-est]
module.tenant_policies.aci_contract_subject.est: Refreshing state... [id=uni/tn-common/brc-Established/subj-est_subj]
module.tenant_policies.aci_contract_subject_filter.est: Refreshing state... [id=uni/tn-common/brc-Established/subj-est_subj/rssubjFiltAtt-est]
module.devvie_project_2.fmc_network_objects.aci_net: Refreshing state... [id=005056BF-7B88-0ed3-0000-012886513620]
module.devvie_project_1.fmc_network_objects.aci_net: Refreshing state... [id=005056BF-7B88-0ed3-0000-012886513601]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.devvie_project_1.aci_application_epg.devvie_application_epg has been deleted
  - resource "aci_application_epg" "devvie_application_epg" {
      - id                     = "uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg" -> null
        name                   = "devvie_project_1_epg"
        # (15 unchanged attributes hidden)
    }

  # module.devvie_project_1.aci_application_profile.devvie_app_profile has been deleted
  - resource "aci_application_profile" "devvie_app_profile" {
      - id          = "uni/tn-devvie/ap-devvie_project_1_ap" -> null
        name        = "devvie_project_1_ap"
        # (4 unchanged attributes hidden)
    }

  # module.devvie_project_1.aci_bridge_domain.devvie_bridge_domain has been deleted
  - resource "aci_bridge_domain" "devvie_bridge_domain" {
      - id                          = "uni/tn-devvie/BD-vlan_15_bd" -> null
        name                        = "vlan_15_bd"
        # (24 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_access_generic.epg_to_aep has been deleted
  - resource "aci_access_generic" "epg_to_aep" {
      - id                                  = "uni/infra/attentp-aaep_devvie/gen-default" -> null
        name                                = "default"
        # (2 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_attachable_access_entity_profile.devvie_aaep has been deleted
  - resource "aci_attachable_access_entity_profile" "devvie_aaep" {
      - id                      = "uni/infra/attentp-aaep_devvie" -> null
        name                    = "aaep_devvie"
        # (2 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_cdp_interface_policy.cdp_policy has been deleted
  - resource "aci_cdp_interface_policy" "cdp_policy" {
      - id         = "uni/infra/cdpIfP-cdp_policy" -> null
        name       = "cdp_policy"
        # (2 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_fabric_if_pol.if_policy has been deleted
  - resource "aci_fabric_if_pol" "if_policy" {
      - id            = "uni/infra/hintfpol-link_level_auto" -> null
        name          = "link_level_auto"
        # (5 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_lacp_policy.lacp_policy has been deleted
  - resource "aci_lacp_policy" "lacp_policy" {
      - id         = "uni/infra/lacplagp-lacp_policy_active" -> null
        name       = "lacp_policy_active"
        # (5 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_lldp_interface_policy.lldp_policy has been deleted
  - resource "aci_lldp_interface_policy" "lldp_policy" {
      - id          = "uni/infra/lldpIfP-lldp_policy" -> null
        name        = "lldp_policy"
        # (3 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_miscabling_protocol_interface_policy.mcp_policy has been deleted
  - resource "aci_miscabling_protocol_interface_policy" "mcp_policy" {
      - id         = "uni/infra/mcpIfP-mcp_policy" -> null
        name       = "mcp_policy"
        # (2 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_physical_domain.devvie_physdom has been deleted
  - resource "aci_physical_domain" "devvie_physdom" {
      - id                            = "uni/phys-physdom_devvie" -> null
        name                          = "physdom_devvie"
        # (3 unchanged attributes hidden)
    }

  # module.fabric_policies.aci_vlan_pool.devvie_vlan_pool has been deleted
  - resource "aci_vlan_pool" "devvie_vlan_pool" {
      - id         = "uni/infra/vlanns-[devvie_vlan_pool]-static" -> null
        name       = "devvie_vlan_pool"
        # (2 unchanged attributes hidden)
    }

  # module.tenant_policies.aci_contract.est has been deleted
  - resource "aci_contract" "est" {
      - id               = "uni/tn-common/brc-Established" -> null
        name             = "Established"
        # (7 unchanged attributes hidden)
    }

  # module.tenant_policies.aci_contract_subject.est has been deleted
  - resource "aci_contract_subject" "est" {
      - id                           = "uni/tn-common/brc-Established/subj-est_subj" -> null
        name                         = "est_subj"
        # (9 unchanged attributes hidden)
    }

  # module.tenant_policies.aci_tenant.devvie has been deleted
  - resource "aci_tenant" "devvie" {
      - id          = "uni/tn-devvie" -> null
        name        = "devvie"
        # (2 unchanged attributes hidden)
    }

  # module.tenant_policies.aci_vrf.common has been deleted
  - resource "aci_vrf" "common" {
      - id                     = "uni/tn-common/ctx-common" -> null
        name                   = "common"
        # (7 unchanged attributes hidden)
    }

  # module.tenant_policies.aci_vrf.devvie has been deleted
  - resource "aci_vrf" "devvie" {
      - id                     = "uni/tn-devvie/ctx-devvie" -> null
        name                   = "devvie"
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.devvie_project_1.aci_application_epg.devvie_application_epg will be created
  + resource "aci_application_epg" "devvie_application_epg" {
      + annotation                  = "tag_epg"
      + application_profile_dn      = (known after apply)
      + description                 = "EPG for devvie_project_1"
      + exception_tag               = "0"
      + flood_on_encap              = "disabled"
      + fwd_ctrl                    = (known after apply)
      + has_mcast_source            = "no"
      + id                          = (known after apply)
      + is_attr_based_epg           = "no"
      + match_t                     = "AtleastOne"
      + name                        = "devvie_project_1_epg"
      + name_alias                  = (known after apply)
      + pc_enf_pref                 = "unenforced"
      + pref_gr_memb                = "exclude"
      + prio                        = "unspecified"
      + relation_fv_rs_bd           = (known after apply)
      + relation_fv_rs_cust_qos_pol = (known after apply)
      + shutdown                    = "no"
    }

  # module.devvie_project_1.aci_application_profile.devvie_app_profile will be created
  + resource "aci_application_profile" "devvie_app_profile" {
      + annotation                = "orchestrator:terraform"
      + description               = "devvie_project_1 ap"
      + id                        = (known after apply)
      + name                      = "devvie_project_1_ap"
      + name_alias                = (known after apply)
      + prio                      = (known after apply)
      + relation_fv_rs_ap_mon_pol = (known after apply)
      + tenant_dn                 = (known after apply)
    }

  # module.devvie_project_1.aci_bridge_domain.devvie_bridge_domain will be created
  + resource "aci_bridge_domain" "devvie_bridge_domain" {
      + annotation                  = "tag_bd"
      + arp_flood                   = "yes"
      + bridge_domain_type          = "regular"
      + description                 = "Bridge Domain for devvie_project_1"
      + ep_clear                    = "no"
      + ep_move_detect_mode         = (known after apply)
      + host_based_routing          = "no"
      + id                          = (known after apply)
      + intersite_bum_traffic_allow = "yes"
      + intersite_l2_stretch        = "yes"
      + ip_learning                 = "yes"
      + ipv6_mcast_allow            = (known after apply)
      + limit_ip_learn_to_subnets   = "yes"
      + ll_addr                     = (known after apply)
      + mac                         = (known after apply)
      + mcast_allow                 = "no"
      + multi_dst_pkt_act           = "bd-flood"
      + name                        = "vlan_15_bd"
      + name_alias                  = (known after apply)
      + optimize_wan_bandwidth      = "no"
      + relation_fv_rs_bd_to_ep_ret = (known after apply)
      + relation_fv_rs_bd_to_nd_p   = (known after apply)
      + relation_fv_rs_ctx          = (known after apply)
      + relation_fv_rs_igmpsn       = (known after apply)
      + relation_fv_rs_mldsn        = (known after apply)
      + tenant_dn                   = (known after apply)
      + unicast_route               = (known after apply)
      + unk_mac_ucast_act           = "proxy"
      + unk_mcast_act               = "flood"
      + v6unk_mcast_act             = (known after apply)
      + vmac                        = "not-applicable"
    }

  # module.devvie_project_1.aci_epg_to_contract.provided_contract will be created
  + resource "aci_epg_to_contract" "provided_contract" {
      + annotation         = "orchestrator:terraform"
      + application_epg_dn = (known after apply)
      + contract_dn        = (known after apply)
      + contract_type      = "provider"
      + id                 = (known after apply)
      + match_t            = (known after apply)
      + prio               = (known after apply)
    }

  # module.devvie_project_1.aci_epg_to_domain.net_2_domain will be created
  + resource "aci_epg_to_domain" "net_2_domain" {
      + allow_micro_seg       = (known after apply)
      + annotation            = "orchestrator:terraform"
      + application_epg_dn    = (known after apply)
      + binding_type          = (known after apply)
      + custom_epg_name       = (known after apply)
      + delimiter             = (known after apply)
      + encap                 = (known after apply)
      + encap_mode            = (known after apply)
      + epg_cos               = (known after apply)
      + epg_cos_pref          = (known after apply)
      + id                    = (known after apply)
      + instr_imedcy          = (known after apply)
      + lag_policy_name       = (known after apply)
      + netflow_dir           = (known after apply)
      + netflow_pref          = (known after apply)
      + num_ports             = (known after apply)
      + port_allocation       = (known after apply)
      + primary_encap         = (known after apply)
      + primary_encap_inner   = (known after apply)
      + res_imedcy            = (known after apply)
      + secondary_encap_inner = (known after apply)
      + switching_mode        = (known after apply)
      + tdn                   = (known after apply)
      + vmm_allow_promiscuous = (known after apply)
      + vmm_forged_transmits  = (known after apply)
      + vmm_id                = (known after apply)
      + vmm_mac_changes       = (known after apply)
    }

  # module.devvie_project_1.aci_epgs_using_function.epg_to_aep_assign will be created
  + resource "aci_epgs_using_function" "epg_to_aep_assign" {
      + access_generic_dn = (known after apply)
      + annotation        = "orchestrator:terraform"
      + encap             = "vlan-15"
      + id                = (known after apply)
      + instr_imedcy      = (known after apply)
      + mode              = "regular"
      + primary_encap     = (known after apply)
      + tdn               = (known after apply)
    }

  # module.devvie_project_1.aci_subnet.subnet will be created
  + resource "aci_subnet" "subnet" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = (known after apply)
      + description = "This subnet is created by terraform"
      + id          = (known after apply)
      + ip          = "192.168.15.1/24"
      + name_alias  = (known after apply)
      + parent_dn   = (known after apply)
      + preferred   = "no"
      + scope       = [
          + "public",
          + "shared",
        ]
      + virtual     = (known after apply)
    }

  # module.devvie_project_2.fmc_network_objects.aci_net will be destroyed
  # (because fmc_network_objects.aci_net is not in configuration)
  - resource "fmc_network_objects" "aci_net" {
      - description = " " -> null
      - id          = "005056BF-7B88-0ed3-0000-012886513620" -> null
      - name        = "devvie_project_2" -> null
      - type        = "Network" -> null
      - value       = "192.168.16.0/24" -> null
    }

  # module.devvie_project_2.netbox_prefix.prefix will be destroyed
  # (because netbox_prefix.prefix is not in configuration)
  - resource "netbox_prefix" "prefix" {
      - id            = "5" -> null
      - is_pool       = false -> null
      - mark_utilized = false -> null
      - prefix        = "192.168.16.0/24" -> null
      - role_id       = 0 -> null
      - site_id       = 0 -> null
      - status        = "active" -> null
      - tags          = [] -> null
      - tenant_id     = 0 -> null
      - vlan_id       = 6 -> null
      - vrf_id        = 0 -> null
    }

  # module.devvie_project_2.netbox_vlan.vlan will be destroyed
  # (because netbox_vlan.vlan is not in configuration)
  - resource "netbox_vlan" "vlan" {
      - id     = "6" -> null
      - name   = "devvie_project_2" -> null
      - status = "active" -> null
      - tags   = [] -> null
      - vid    = 16 -> null
    }

  # module.fabric_policies.aci_access_generic.epg_to_aep will be created
  + resource "aci_access_generic" "epg_to_aep" {
      + annotation                          = "orchestrator:terraform"
      + attachable_access_entity_profile_dn = (known after apply)
      + description                         = (known after apply)
      + id                                  = (known after apply)
      + name                                = "default"
      + name_alias                          = (known after apply)
    }

  # module.fabric_policies.aci_attachable_access_entity_profile.devvie_aaep will be created
  + resource "aci_attachable_access_entity_profile" "devvie_aaep" {
      + annotation              = "orchestrator:terraform"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "aaep_devvie"
      + name_alias              = (known after apply)
      + relation_infra_rs_dom_p = (known after apply)
    }

  # module.fabric_policies.aci_cdp_interface_policy.cdp_policy will be created
  + resource "aci_cdp_interface_policy" "cdp_policy" {
      + admin_st    = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "cdp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_fabric_if_pol.if_policy will be created
  + resource "aci_fabric_if_pol" "if_policy" {
      + annotation    = "orchestrator:terraform"
      + auto_neg      = "on"
      + description   = (known after apply)
      + fec_mode      = "inherit"
      + id            = (known after apply)
      + link_debounce = "100"
      + name          = "link_level_auto"
      + name_alias    = (known after apply)
      + speed         = "inherit"
    }

  # module.fabric_policies.aci_lacp_policy.lacp_policy will be created
  + resource "aci_lacp_policy" "lacp_policy" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = [
          + "fast-sel-hot-stdby",
          + "graceful-conv",
          + "susp-individual",
        ]
      + description = (known after apply)
      + id          = (known after apply)
      + max_links   = "16"
      + min_links   = "1"
      + mode        = "active"
      + name        = "lacp_policy_active"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_1"] will be created
  + resource "aci_leaf_access_bundle_policy_group" "devvie" {
      + annotation                               = "orchestrator:terraform"
      + description                              = (known after apply)
      + id                                       = (known after apply)
      + lag_t                                    = "node"
      + name                                     = "VPC_DEVVIE_1"
      + name_alias                               = (known after apply)
      + relation_infra_rs_att_ent_p              = "uni/infra/attentp-aaep_devvie"
      + relation_infra_rs_cdp_if_pol             = (known after apply)
      + relation_infra_rs_copp_if_pol            = (known after apply)
      + relation_infra_rs_fc_if_pol              = (known after apply)
      + relation_infra_rs_h_if_pol               = (known after apply)
      + relation_infra_rs_l2_if_pol              = (known after apply)
      + relation_infra_rs_l2_port_auth_pol       = (known after apply)
      + relation_infra_rs_l2_port_security_pol   = (known after apply)
      + relation_infra_rs_lacp_pol               = (known after apply)
      + relation_infra_rs_lldp_if_pol            = (known after apply)
      + relation_infra_rs_macsec_if_pol          = (known after apply)
      + relation_infra_rs_mcp_if_pol             = (known after apply)
      + relation_infra_rs_mon_if_infra_pol       = (known after apply)
      + relation_infra_rs_qos_dpp_if_pol         = (known after apply)
      + relation_infra_rs_qos_egress_dpp_if_pol  = (known after apply)
      + relation_infra_rs_qos_ingress_dpp_if_pol = (known after apply)
      + relation_infra_rs_qos_pfc_if_pol         = (known after apply)
      + relation_infra_rs_qos_sd_if_pol          = (known after apply)
      + relation_infra_rs_stormctrl_if_pol       = (known after apply)
      + relation_infra_rs_stp_if_pol             = (known after apply)
    }

  # module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_2"] will be created
  + resource "aci_leaf_access_bundle_policy_group" "devvie" {
      + annotation                               = "orchestrator:terraform"
      + description                              = (known after apply)
      + id                                       = (known after apply)
      + lag_t                                    = "node"
      + name                                     = "VPC_DEVVIE_2"
      + name_alias                               = (known after apply)
      + relation_infra_rs_att_ent_p              = "uni/infra/attentp-aaep_devvie"
      + relation_infra_rs_cdp_if_pol             = (known after apply)
      + relation_infra_rs_copp_if_pol            = (known after apply)
      + relation_infra_rs_fc_if_pol              = (known after apply)
      + relation_infra_rs_h_if_pol               = (known after apply)
      + relation_infra_rs_l2_if_pol              = (known after apply)
      + relation_infra_rs_l2_port_auth_pol       = (known after apply)
      + relation_infra_rs_l2_port_security_pol   = (known after apply)
      + relation_infra_rs_lacp_pol               = (known after apply)
      + relation_infra_rs_lldp_if_pol            = (known after apply)
      + relation_infra_rs_macsec_if_pol          = (known after apply)
      + relation_infra_rs_mcp_if_pol             = (known after apply)
      + relation_infra_rs_mon_if_infra_pol       = (known after apply)
      + relation_infra_rs_qos_dpp_if_pol         = (known after apply)
      + relation_infra_rs_qos_egress_dpp_if_pol  = (known after apply)
      + relation_infra_rs_qos_ingress_dpp_if_pol = (known after apply)
      + relation_infra_rs_qos_pfc_if_pol         = (known after apply)
      + relation_infra_rs_qos_sd_if_pol          = (known after apply)
      + relation_infra_rs_stormctrl_if_pol       = (known after apply)
      + relation_infra_rs_stp_if_pol             = (known after apply)
    }

  # module.fabric_policies.aci_lldp_interface_policy.lldp_policy will be created
  + resource "aci_lldp_interface_policy" "lldp_policy" {
      + admin_rx_st = "enabled"
      + admin_tx_st = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "lldp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_miscabling_protocol_interface_policy.mcp_policy will be created
  + resource "aci_miscabling_protocol_interface_policy" "mcp_policy" {
      + admin_st    = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "mcp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_physical_domain.devvie_physdom will be created
  + resource "aci_physical_domain" "devvie_physdom" {
      + annotation                         = "orchestrator:terraform"
      + id                                 = (known after apply)
      + name                               = "physdom_devvie"
      + name_alias                         = (known after apply)
      + relation_infra_rs_dom_vxlan_ns_def = (known after apply)
      + relation_infra_rs_vlan_ns          = (known after apply)
      + relation_infra_rs_vlan_ns_def      = (known after apply)
    }

  # module.fabric_policies.aci_ranges.vlan_2_50_range will be created
  + resource "aci_ranges" "vlan_2_50_range" {
      + alloc_mode   = "static"
      + annotation   = "orchestrator:terraform"
      + description  = (known after apply)
      + from         = "vlan-2"
      + id           = (known after apply)
      + name_alias   = (known after apply)
      + role         = (known after apply)
      + to           = "vlan-50"
      + vlan_pool_dn = (known after apply)
    }

  # module.fabric_policies.aci_vlan_pool.devvie_vlan_pool will be created
  + resource "aci_vlan_pool" "devvie_vlan_pool" {
      + alloc_mode  = "static"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "devvie_vlan_pool"
      + name_alias  = (known after apply)
    }

  # module.tenant_policies.aci_any.vzany will be created
  + resource "aci_any" "vzany" {
      + annotation                 = "orchestrator:terraform"
      + description                = (known after apply)
      + id                         = (known after apply)
      + match_t                    = "AtleastOne"
      + name_alias                 = (known after apply)
      + pref_gr_memb               = "disabled"
      + relation_vz_rs_any_to_cons = (known after apply)
      + relation_vz_rs_any_to_prov = (known after apply)
      + vrf_dn                     = (known after apply)
    }

  # module.tenant_policies.aci_contract.est will be created
  + resource "aci_contract" "est" {
      + annotation       = "orchestrator:terraform"
      + description      = (known after apply)
      + filter_entry_ids = (known after apply)
      + filter_ids       = (known after apply)
      + id               = (known after apply)
      + name             = "Established"
      + name_alias       = (known after apply)
      + prio             = (known after apply)
      + scope            = "context"
      + target_dscp      = (known after apply)
      + tenant_dn        = "uni/tn-common"

      + filter {
          + annotation  = (known after apply)
          + description = (known after apply)
          + filter_name = (known after apply)
          + id          = (known after apply)
          + name_alias  = (known after apply)

          + filter_entry {
              + annotation        = (known after apply)
              + apply_to_frag     = (known after apply)
              + arp_opc           = (known after apply)
              + d_from_port       = (known after apply)
              + d_to_port         = (known after apply)
              + description       = (known after apply)
              + entry_annotation  = (known after apply)
              + entry_description = (known after apply)
              + entry_name_alias  = (known after apply)
              + ether_t           = (known after apply)
              + filter_entry_name = (known after apply)
              + icmpv4_t          = (known after apply)
              + icmpv6_t          = (known after apply)
              + id                = (known after apply)
              + match_dscp        = (known after apply)
              + prot              = (known after apply)
              + s_from_port       = (known after apply)
              + s_to_port         = (known after apply)
              + stateful          = (known after apply)
              + tcp_rules         = (known after apply)
            }
        }
    }

  # module.tenant_policies.aci_contract_subject.est will be created
  + resource "aci_contract_subject" "est" {
      + annotation                    = "orchestrator:terraform"
      + apply_both_directions         = "yes"
      + cons_match_t                  = (known after apply)
      + contract_dn                   = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + name                          = "est_subj"
      + name_alias                    = (known after apply)
      + prio                          = (known after apply)
      + prov_match_t                  = (known after apply)
      + relation_vz_rs_sdwan_pol      = (known after apply)
      + relation_vz_rs_subj_filt_att  = [
          + "uni/tn-common/flt-est",
        ]
      + relation_vz_rs_subj_graph_att = (known after apply)
      + rev_flt_ports                 = "yes"
      + target_dscp                   = (known after apply)
    }

  # module.tenant_policies.aci_contract_subject_filter.est will be created
  + resource "aci_contract_subject_filter" "est" {
      + action              = "permit"
      + annotation          = "orchestrator:terraform"
      + contract_subject_dn = (known after apply)
      + description         = (known after apply)
      + directives          = (known after apply)
      + filter_dn           = "uni/tn-common/flt-est"
      + id                  = (known after apply)
      + priority_override   = "default"
    }

  # module.tenant_policies.aci_tenant.devvie will be created
  + resource "aci_tenant" "devvie" {
      + annotation                    = "orchestrator:terraform"
      + description                   = "Tenant for Devvie"
      + id                            = (known after apply)
      + name                          = "devvie"
      + name_alias                    = (known after apply)
      + relation_fv_rs_tenant_mon_pol = (known after apply)
    }

  # module.tenant_policies.aci_vrf.common will be created
  + resource "aci_vrf" "common" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = (known after apply)
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "common"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = "uni/tn-common"
    }

  # module.tenant_policies.aci_vrf.devvie will be created
  + resource "aci_vrf" "devvie" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = "VRF for Devvie"
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "devvie"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = (known after apply)
    }

Plan: 26 to add, 0 to change, 3 to destroy.

Warning: Possibly unsupported Netbox version

  with provider["registry.terraform.io/e-breuninger/netbox"],
  on main.tf line 13, in provider "netbox":
  13: provider "netbox" {

Your Netbox version is v3.7.5. The provider was successfully tested against
the following versions:

  3.7.0

Unexpected errors may occur.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tfplan"

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*